/*
Коунтер ап экинчи бетте да иштөөчү

Тиркемени түзүп StateFulWidgetтин State классына интиджер тибинде маанисине индекс деп ат берип 
өзгөрмөнүн маанисин 0 го барабарла, андан соң ошол эле жарыяланган өзгөрмөнүн астына функция түзүп 
сет стейт менен индексти++ менен оро. Эми индексти текстке берип кнопканы басканда тексттеги индекс кошулуш
үчүн кнопканын функциясына кошуучу функцияны берип кой. Бул иштеди. Эми ушул текстеги индекс кошулганын башка 
баракта көрүш үчүн Экинчи баракты түзүп ал экинчи баракка интежер алуучу бир интеджер тибине ат кой жана конструкторго
милдеттендир. Андан кийин Навигатор менен келген баракка милдеттенген интеджер тибин алган атты берип ага биринчи барактагы 
индексти бекитип кой. Эми бекилген индексти экинчи барактагы текстке ${widget.count}. count бул экинчи беттин
конструкторуна милдеттендирилген виджет. Жана ушул виджет аркылуу алынган индекстин абалын экинчи бетте да көрө беребиз.
 */