class AppText {
  static const String gameTitle = 'Мамлекеттер борбору';
  static const String asia = 'Азия';
  static const String europe = 'Европа';
  static const String northAmerica = 'Түндүк Америка';
  static const String southAmerica = 'Түштүк Америка';
  static const String africa = 'Африка';
  static const String australia = 'Австралия';
  // География темалары
  static const String capitals =
      'Дүйнөнүн 196 Капитал 2017-жылга карата абал боюнча, бар 196 элдер дүйнөдө расмий көз карандысыз өлкө катары таанылган, өз борбор шаары менен ар бир.Бирок, ээ болгон өлкөлөрдүн олуттуу саны бар бир нече борбор шаарлары . Андай болсо, кошумча борбор шаарлар, ошондой эле келтирилген."Менин World Атлас" планетадагы ар бир өлкөнүн көптөгөн алыскы өлкөлөр жөнүндө Карталар жана аймактардын маалымат берет. дүйнөдөгү 196 өлкөнүн ар карталарында жана жагынан маалымат алуу үчүн байланышкан өлкө аталышы керек.196 Өлкөлөр жана алардын борборлору ар бир көз карандысыз эл ушул көрсөтүлгөн тизмесин текшерип (2017-жылга карата) жана анын борбор шаары:';
}
