class ApiConst {
  static const apiKey = '2d01e9e3d28d4189b48461be856e9655';
  //Жалпысынан алганда, домен жаңылыктарды кабыл алууга байланыштуу аракеттер аткарылуучу доменди (өлкөнү) билдирет. Кайсы өлкө үчүн кабар алуу керектигин аныктоо үчүн ар кандай функцияларга жана ыкмаларга өткөрүлүп берилет. Бул тиркемеде же колдонуучунун интерфейсинде тиешелүү жаңылыктарды суроого жана көрсөтүүгө мүмкүндүк берет.
  static String topNews([String? domain]) =>
      'https://newsapi.org/v2/top-headlines?country=${domain ?? 'us'}&apiKey=$apiKey';
  static const newsImage =
      'https://pbs.twimg.com/profile_images/1108430392267280389/ufmFwzIn_400x400.png';
}

  /*
  topNews([Стринг? домен]) - башкы жаңылыктарды алуу үчүн URL дарегин кайтаруучу статикалык 
  ыкма. Бул жаңылык домени болгон кошумча параметр доменин алат. Эгер домен көрсөтүлбөсө, 
  анда "биз" (АКШ үчүн) колдонулат. apiKey өзгөрмөсү жаңылыктарды сурап жатканда аныктыгын 
  текшерүү үчүн колдонулат.

  fetchTopNews([String? домен]) - жаңылык API'сине чыныгы суроо-талапты жасаган асинхрондук 
  ыкма. Ал суроо үчүн жаңылык доменин белгилеген кошумча домен параметрин кабыл алат.
   Методдун ичинде topNews() методунан алынган URL аркылуу Uri классынын мисалы түзүлөт 
   жана http пакетинин жардамы менен GET сурамы жасалат. Жооп жооптун өзгөрмөсүндө сакталат.

   fetchNews([Стринг? домен]) - башкы жаңылыктарды алуу жана виджеттин абалын setState()
    менен жаңыртуу үчүн fetchTopNews() чакырган асинхрондук ыкма. Домен параметри жаңылык
     доменин аныктоо үчүн fetchTopNews() га өткөрүлөт.

  PopupMenuButton<Өлкөлөр> бул ачылуучу меню виджети, ал өлкөлөрдүн тизмесин көрсөтөт жана
   алардын бирин тандоого мүмкүндүк берет. Колдонуучу элементти тандаганда, onSelected 
   иштеткичи чакырылат, ал тандалган домен менен fetchNews() чакырат жана виджеттин абалын
    setState() менен жаңылайт. ItemBuilder ыкмасы өлкөлөр тизмесинин негизинде ачылуучу меню
     пункттарын түзүү үчүн колдонулат.

  Жалпы идея, колдонуучу ачылуучу менюдан жаңылыктар доменин тандай алат жана жаңы доменди
   тандоо тандалган доменди колдонуу менен News API'ге суроо-талапты жаратат. Кабыл алынган
    жаңылыктар setState() аркылуу экранда жаңыртылып турат.
   */
