/*
1. Бул окуу куралынын маанилүү бөлүгү бул piese.dart файлы. Эми, муну жасаардан мурун, мен бүтүндөй 
тиркеме үчүн туруктуу жана жалпы баалуулуктар болушу үчүн баалуулук деп аталган дагы бир файлды түзөм.
 Эми эң негизгиси, мен энамды түзөм, бул жөн гана биз тетроминолордун бир нече түрлөрүн түзгүбүз келет 
 дегенди билдирет, андыктан тетроминолор сиз ала турган ар кандай тетрис. Ошентип, сиз L J O S формасында боло аласыз.

 2. Kелгиле, биздин кесим классыбызды түзөлү жана биз бул чыгарманын түрү кандай экенин билишибиз
  керек жана эгер сиз бул жөнүндө чындап ойлонсоңуз, ал бүтүн сандардын тизмеси болуп калат. сандарды биз бул позиция 
  деп атайбыз жана бир жолу биз түрү кандай экенин билебиз, келгиле бүтүн сандарды түзөлү, андыктан мен бул жерде жөн 
  гана инициализациялоочу бөлүгү деп аталган ыкманы түзөм деп жатам, эми бул түрү кандай болоруна жараша болот, андыктан 
  жөн гана айталы биринчи мисал, эгерде түрү L бөлүгү болсо, анда келгиле, Positionдy карап көрөлү, андыктан ал ушул 
  сыяктуу бир нерсе болушу мүмкүн 4 14 24 25, андыктан бул бөлүктөрдү кантип жаратаарыбыз жөнүндө түшүнүк берүү үчүн,
   келгиле,ага кайтып келели. тактасын жана учурдагы тетрис бөлүгүн түзөлү.

 3. Ошентип, бул сандарды колдонуп, биз досканын айланасында жылдырып, ошондой эле ар кандай фигураларды түзөбүз,
  эми алдыга жылардан мурун файлга кайтып баралы жана мен /DIRECTIONS/ үчүн дагы бир enum түзөм, ошондо биздин формабыз
   сол. ,оңго, ылдыйга, эми өзүбүздүн /movePiece/ методубузду түзөлү, бизде параметр бар болсо жана биз
   /DIRECTION/ деген эмне экенин биле турган болсок, биринчи учурда айталы, эгер ал түшүп кетсе, биз эмне кылабыз биз
    тез for циклин жасап, /position/ тизмебиздеги бүтүн сандарды карап чыгабыз жана /rowLength/ кошсоңуз оңго 
    /rowLength/ кошобуз, бул сиз түшүп бара жатканыңызды билдирет.

 4. келгиле, солду жана оңду да толтуралы, анткени ал абдан окшош, солго жылдыруу биз жөн гана 1ди кемите турганыбызды 
 билдирет, ал эми оңго жылып бирди кошобуз.

 5. 
биз абалды инициализациялап, оюнду баштаганда, биз кичинекей оюн циклин түзүү керек экенин билебиз, ошондуктан бизге 
кадр ылдамдыгы керек, демек, биз /узактыгы/ тандайбыз дегенди билдирет, 4 секунд дейли жана бул негизинен ылдамдык 
оюндун, ошондуктан мен жөн эле биздин оюн циклин түз эле okey астында түзсөм, анда /FRAMERITE/ бериңиз, /ТАЙМЕР/ сизге 
керектүү нерсени колдонолу. Мен буга чейин таймерлерди көп жолу колдонгом, бирок ал ар бир 4 секунд сайын коддун бөлүгүн
туура аткарат, андыктан ар бир 4 секунд сайын бөлүктү ылдый жылдырып көрөлү, ал ошол жерде жана сиз көрө аласыз.
 */