/*
1. Бул окуу куралынын маанилүү бөлүгү бул piese.dart файлы. Эми, муну жасаардан мурун, мен бүтүндөй 
тиркеме үчүн туруктуу жана жалпы баалуулуктар болушу үчүн баалуулук деп аталган дагы бир файлды түзөм.
 Эми эң негизгиси, мен энамды түзөм, бул жөн гана биз тетроминолордун бир нече түрлөрүн түзгүбүз келет 
 дегенди билдирет, андыктан тетроминолор сиз ала турган ар кандай тетрис. Ошентип, сиз L J O S формасында боло аласыз.

 2. Kелгиле, биздин кесим классыбызды түзөлү жана биз бул чыгарманын түрү кандай экенин билишибиз
  керек жана эгер сиз бул жөнүндө чындап ойлонсоңуз, ал бүтүн сандардын тизмеси болуп калат. сандарды биз бул позиция 
  деп атайбыз жана бир жолу биз түрү кандай экенин билебиз, келгиле бүтүн сандарды түзөлү, андыктан мен бул жерде жөн 
  гана инициализациялоочу бөлүгү деп аталган ыкманы түзөм деп жатам, эми бул түрү кандай болоруна жараша болот, андыктан 
  жөн гана айталы биринчи мисал, эгерде түрү L бөлүгү болсо, анда келгиле, Positionдy карап көрөлү, андыктан ал ушул 
  сыяктуу бир нерсе болушу мүмкүн 4 14 24 25, андыктан бул бөлүктөрдү кантип жаратаарыбыз жөнүндө түшүнүк берүү үчүн,
   келгиле,ага кайтып келели. тактасын жана учурдагы тетрис бөлүгүн түзөлү
 */